faculty-vote-app/app/controllers/authentication_controller.rb

  def signup_submit
    @user = User.create!({:first_name => params[:first_name]["First Name"], :last_name => params[:last_name]["Last Name"], :email => params[:email]["Email"], :created_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}", :updated_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}", :password => params[:password]["Password"]})
---
INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["email", ""], ["created_at", "2019-11-19 22:14:59.000000"], ["updated_at", "2019-11-19 22:14:59.000000"], ["password", ""]]

  def create
    if (User.exists?(email: params[:email], password: params[:pwd]))
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT 1  [["email", ""], ["password", ""]]