faculty-vote-app/app/controllers/proposals_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort

    when 'date'
      ordering,@date_header = {:date => :asc}, 'hilite'
    end

    @proposals = Proposal.order(ordering)
---
SELECT "proposals".* FROM "proposals"

  def create
    @proposal = Proposal.create!(:name => params[:name]["Proposal Name"], :created_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}", :updated_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}")
---
INSERT INTO "proposals" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2019-11-17 00:02:38.000000"], ["updated_at", "2019-11-17 00:02:38.000000"], ["name", "{\"Proposal Name\"=>\"h\"}"]]

  def destroy
    @proposal = Proposal.find(params[:id])
    @proposal.destroy
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", 20]]
DELETE FROM "proposals" WHERE "proposals"."id" = ?  [["id", 20]]