app/controllers/authentication_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "1"], ["last_name", "2"], ["email", "1@1.com"], ["created_at", "2019-11-19 22:10:56.000000"], ["updated_at", "2019-11-19 22:10:56.000000"], ["password", "1"]]
---
  def signup_submit
    @user = User.create!({:first_name => params[:first_name]["First Name"], :last_name => params[:last_name]["Last Name"], :email => params[:email]["Email"], :created_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}", :updated_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}", :password => params[:password]["Password"]})

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT 1  [["email", "1@1.com"], ["password", "1"]]
---
  def create
    session[:user_id] = '0'
    if (User.exists?(email: params[:email], password: params[:pwd]))