app/controllers/proposals_controller.rb

SELECT "proposals".* FROM "proposals"
SELECT "proposals".* FROM "proposals" WHERE "proposals"."status" = ?  [["status", 0]]
---
  def index
    sort = params[:sort] || session[:sort]
    case sort

    when 'date'
      ordering,@date_header = {:date => :asc}, 'hilite'
    end

    @proposals = Proposal.order(ordering)
    @proposals = Proposal.where(:status => 0)

SELECT "proposals".* FROM "proposals" WHERE "proposals"."status" = ?  [["status", 1]]
---
  def show
    @proposals = Proposal.where(:status => 1)

INSERT INTO "proposals" ("name", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "jjj"], ["status", 0], ["created_at", "2019-11-23 17:29:53.000000"], ["updated_at", "2019-11-23 17:29:53.000000"]]
---
  def create
    @proposal = Proposal.create!(:name => params[:name]["Proposal Name"], :status => '0', :created_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}", :updated_at => "#{Time.now.strftime("%Y-%m-%d %H:%M:%S")}")

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "proposals" WHERE "proposals"."id" = ?  [["id", 11]]
---
  def destroy
    @proposal = Proposal.find(params[:id])
    @proposal.destroy

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "proposals" SET "number_abstain" = ?, "updated_at" = ? WHERE "proposals"."id" = ?  [["number_abstain", 2], ["updated_at", "2019-12-05 21:51:41.179433"], ["id", 8]]
---
  def edit
    @proposal = Proposal.find(params[:id])
    if (params[:state] == '1')
      @proposal.increment!(:number_yes)